[
    {
        "id": "rabalder",
        "titleText": "Designing a visual identity for a guitarstore",
        "descriptionText": "With this project, I created a visual identity, an interactive asset generator, and an animated logo for a fictional guitar store called Rabalder inspired by the song 'Rabalderstræde' by the famous danish band Gasolin.",
        "titleImage": "/media/musikinstrumenterbutik_rabalder.jpg",
        "Image2": "/media/rabalderIdentitet.png",
        "description2Text": "The logo is brought to life using Processing, reflecting Rabalder's identity as a guitar store that values experimentation, playfulness, and curiosity.",
        "video3": "/media/Animeret_Navnetræk_CD.mp4",
        "image4":"/media/Visuel_identitet.png",
        "video3": "/media/rabalderAssetGenrator.mp4",
        "description25Text": "This is an asset generator created in Processing. It produces posters using sound input. Users can also adjust both text and colors, making it easy to customize to fit different events.",
        "image6":"/media/striber.png"
       

    }
,
    {
        "id": "creativecoding",
        "titleText": "Creative coding in Processing + plotting",
        "descriptionText": "In this project, I explored different design concepts through creative coding, with some designs plotted on paper using an axis plotter.",
        "video": "/media/plotter2.mp4",
        "Image2": "/media/cirkler.png",
        "description2Text": "This drawing was created using an axis plotter, with two 3D spheres coded in Processing.",
        "video3": "/media/squaresmoving.mp4",
        "video4": "/media/portrait.mp4",
        "description3Text": "I’ve designed a self-portrait in Processing that reveals itself as you move the mouse, creating a dynamic halftone effect.",
        "video5": "/media/plotter.mp4",
        "image6": "/media/motiv.png",
        "image7":"/media/white.png"
    }
    ,
    {
        "id": "ai",
        "titleText": "Intelligent design",
        "descriptionText": "In my 3rd semester of the Coded Design programme at the Danish School of Media and Journalism, we took a three-week course on Intelligent Design. The course challenged us to apply intelligent design principles to generate new and innovative ideas. Here are two examples of my work from the course.",
        "video":"/media/dogma of the day.mp4",
        "description3Text": "Dogma of the Day is a site that presents a new AI-generated dogma every time you refresh the site. You can sign it and save it as a PNG, making each visit a unique experience. It is powered by OpenAI's generative technology.",
        "video3":"/media/nickname.mp4",
        "description3Text": "Nickname Generator creates unique nicknames based on your name using OpenAI's generative technology. Just enter your name, explore a variety of nickname ideas and highlight those you like.",
        "image5": "/media/white.png"




    }   ,
    {
        "id": "mitgronland",
        "titleText": "Experience site about Greenland",
        "descriptionText": "This interactive prototype offers a personal glimpse into six Greenlandic lives, told through the everyday objects that shape them. Designed for a museum setting with an interactive screen, it invites users to explore Greenlandic culture and connect more deeply with the people who call it home. The experience is built using custom code to create an engaging and immersive journey. While the characters are made up and the faces are generated using Midjourney, the intention is for the final version to feature real Greenlandic people and their authentic belongings.",
        "titleImage": "/media/mitgronland.png",
        "Image2": "/media/visualmoodboard.png",
        "description2Text": "Starting on a project, I often create a moodboard to visualize the overall feeling I want to achieve.",
        "Image3": "/media/wireframes.png",
        "video4":"/media/mitgronland.mp4",
        "description3Text": "Here's the prototype. You can click around on the items and faces and listen to the stories that are told when clicked. When clicked on all the items belonging to a person you can click on their face and they'll tell you their story of who they are and why they have chosen these items.",
        "image5": "/media/white.png"


    },
    {
        "id": "story",
        "titleText": "Storytelling + 3D",
        "descriptionText": "In this project, I’ve created an interactive story where you control a lonely girl navigating through a grey world, only to find a light in the fog that reveals a happier version of herself. I used Blender to create custom models and animations, bringing the story to life with Three.js coding.",
        "video": "/media/annika1.mp4",
        "video2": "/media/story.mp4",
        "Image3": "/media/annika.PNG",
        "description3Text": "The character Annika was build from scratch in Blender, then animated to walk and stand.",
        "Image4": "/media/annika2.png",
        "image5": "/media/manu.png",
        "description4Text": "This is the script for the voiceover in the story. Each section is triggered at specific moments as Annika moves through the landscape.",
        "image6": "/media/white.png"



    },
    {
        "id": "projectmapping",
        "titleText": "Project mapping",
        "descriptionText": "In collaboration with Thoravej 29 and Generation Hope, Anna Ellegaard and I created a video projection on a vase for Snart—a lab exploring possible futures. The video, made in After Effects, was based on one of over 3,000 “love letters to the future” collected by Generation Hope. We focused on a letter featuring drawings of lungs and transformed it into a moving visual piece. It was a deeply meaningful project, and the projection remains on display at Snart at Thoravej 29.",
        "video": "/media/blomst.mp4",
        "Image2": "/media/verdenheler.png",
        "description2Text": "This is the love letter collected by Generation Hope Anna and I interpreted.",
        "Image3": "/media/white.png"

    },
    {
        "id": "drawing",
        "titleText": "Drawings",
        "descriptionText": "Since I was a tiny kid I've been drawing. I love to draw and I draw a lot! Here are some of my drawings.",
        "titleImage": "/media/drawing1.JPG",
        "Image2": "/media/drawing2.JPG",
        "Image3": "/media/girls.png",
        "image4":"/media/hygge.jpg",
        "image5":"/media/monster.png",
        "image6":"/media/white.png"
  

    }
]
