[
    {
        "id": "rabalder",
        "titleText": "Designing a visual identity for a guitarstore",
        "descriptionText": "For my first semester exam at DMJX, I created a visual identity, an interactive asset generator, and an animated logo for a fictional guitar store called Rabalder inspired by the song 'Rabalderstræde' by the famous danish band Gasolin.",
        "titleImage": "/media/musikinstrumenterbutik_rabalder.jpg",
        "Image2": "/media/rabalderIdentitet.png",
        "description2Text": "The logo is brought to life using Processing, reflecting Rabalder's identity as a guitar store that values experimentation, playfulness, and curiosity.",
        "video3": "/media/Animeret_Navnetræk_CD.mp4",
        "video5": "/media/rabalderAssetGenrator.mp4",
        "description3Text": "This is an asset generator created in Processing. It produces posters using sound input. Users can also adjust both text and colors, making it easy to customize to fit different events.",
        "image4":"/media/Visuel_identitet.png",
        "image6":"/media/striber.png"

    }
,
    {
        "id": "creativecoding",
        "titleText": "Creative coding in Processing + plotting",
        "descriptionText": "In this project, I explored different design concepts through creative coding, with some designs plotted on paper using an axis plotter.",
        "video": "/media/plotter2.mp4",
        "Image2": "/media/cirkler.png",
        "description2Text": "This drawing was created using an axis plotter, with two 3D spheres coded in Processing.",
        "video3": "/media/squaresmoving.mp4",
        "video4": "/media/portrait.mp4",
        "description3Text": "I’ve designed a self-portrait in Processing that reveals itself as you move the mouse, creating a dynamic halftone effect.",
        "video5": "/media/plotter.mp4"


    }
    ,
    {
        "id": "ai",
        "titleText": "Intelligent design",
        "descriptionText": "In my 3rd semester of the Coded Design programme at the Danish School of Media and Journalism, we took a three-week course on Intelligent Design. The course challenged us to apply intelligent design principles to generate new and innovative ideas. Here are two examples of my work from the course.",
        "video":"/media/dogma of the day.mp4",
        "description2Text": "Dogma of the Day is a site that presents a new AI-generated dogma every time you refresh the site. You can sign it and save it as a PNG, making each visit a unique experience. It is powered by OpenAI's generative technology.",
        "video3":"/media/nickname.mp4",
        "description3Text": "Nickname Generator creates unique nicknames based on your name using OpenAI's generative technology. Just enter your name, explore a variety of nickname ideas and highlight those you like.",
        "image5": "/media/white.png"




    }   ,
    {
        "id": "story",
        "titleText": "Storytelling + 3D",
        "descriptionText": "In this project, I’ve created an interactive story where you control a lonely girl navigating through a grey world, only to find a light in the fog that reveals a happier version of herself. I used Blender to create custom models and animations, bringing the story to life with Three.js coding.",
        "video": "/media/story.mp4",
        "Image2": "/media/annika.PNG",
        "description2Text": "The character Annika was build from scratch in Blender, then animated to walk and stand.",
        "Image3": "/media/annika2.png",
        "image4": "/media/manu.png",
        "description3Text": "This is the script for the voiceover in the story. Each section is triggered at specific moments as Annika moves through the landscape.",
        "image5": "/media/white.png"



    },
    {
        "id": "drawing",
        "titleText": "Drawings",
        "descriptionText": "Since I was a tiny kid I've been drawing. I love to draw and I draw a lot! Here are some of my drawings.",
        "titleImage": "/media/drawing1.JPG",
        "Image2": "/media/drawing2.JPG",
        "Image3": "/media/girls.png",
        "image4":"/media/hygge.jpg",
        "image5":"/media/monster.png",
        "image6":"/media/white.png"
  

    },
    {
        "id": "dance",
        "titleText": "While in battle I'm free, never free to rest",
        "descriptionText": "As the end of the first year of the Coded Design programme at the Danish School of Media and Journalism we had to make a website and poster for a contemporary dance performance called While in battle I'm free, never free to rest.",
        "titleImage": "/media/whileinbattle.png",
        "Image2": "/media/plakat.png",
        "description2Text": "Campaign poster for the dance performance, designed to be displayed around the city for promotion.",
        "video3":"/media/Kampagnesite_video.mp4",
        "video4":"/media/Interaktiv_feature_video.mp4",
        "description3Text": "The website features an interactive option where you can record yourself dancing. You’re encouraged to share your video on social medias, fostering a sense of community.",
        "image5":"/media/white.png"




    }
]
